
{
  "posts": [
  {
    "id": 0,
    "text": "Computer Mouse Balls"
  },
  {
    "id": 1,
    "text": "The Geekcode"
  },
  {
    "id": 2,
    "text": "The Night of the Leeching Dead"
  },
  {
    "id": 3,
    "text": "Warning: This Machine Breaks Down!"
  }  
],
  "texts": [
  {
    "id": 0,
    "text": "Abstract:  Mouse Balls Available as FRU (Field Replacement Unit)\nMouse balls are now available as FRU.  Therefore, if a mouse fails to operate or should it perform erratically, it may need a ball replacement.  Because of the delicate nature of this procedure, replacement of mouse balls should only be attempted by properly trained personnel. \n\nSource: http://textfiles.com/100/balls.txt"
  },
  {
    "id": 1,
    "text": "So you think you are a geek, eh?  The first step is to admit to yourself your geekiness.  No matter what anyone says, geeks are people too; geeks have rights.  So take a deep breath and announce to the world that you are a geek.  Your courage will give you strength that will last you forever. \n\nHow to tell the world you are a geek, you ask?  Use the universal Geek code.  By joining the geek organization, you have license to use this special code that will allow you to let other un-closeted geeks know who you are in a simple, codified statement.\n\nThe single best way to announce your geekhood is to add your geek code to signature file and announce it far and wide.  But be careful, you may give other geeks the courage to come out of the closet.  You might want to hang on to your copy of the code in order to help them along. \n\n\nSource: http://textfiles.com/100/codegeek.txt "
  },
  {
    "id": 2,
    "text": "  \n\t\t\t\t    The \n\t\t\t\t   Night\n\t\t\t\t     of \n\t\t\t     The Leeching Dead!\n\n\t\t\t       -By Apple Core\n\n\n  The story starts out with our pleasant sysop, Weatherman.  He's an all around\ndude, who parties every friday night, drinks his Molsen, and has a good time of\nit.  He also runs his BBS in the meantime.  However, tonite is going to be the\nworst friday of his life.....\n\n  Friday, May 15th, 8:16 p.m.  Apple Core (Me) has just signed off of the\nWeatherstation to go on his trip to Ocean City.  Soon after I had packed my\nstuff away (Including a Blotto box, 2 6-packs of Coors, and an electric tooth-\nbrush), I get a call from Adam Bomb.  \"Oh, my GOD!  Have you heard what\nhappened to Weatherstation?!\",he yelled.  I replied,\"No.  I just got off 1/2\nhour ago...\".  \"It's been infested with LOSERS!  Nooooooo!  They're leeching\nall of his wares!  I mean EVERYTHING!\".  I thought for a moment, recollected my\ncool, and thought of possible ways that a loser could've gotten onto WS.\n\"Can't think of any POSSIBLE way a leech could've gotten on.  Quick, get those\nbombs you made last summer, and call up Rotten Apple!  We'll meet at the mall\nin 5 mins.\"\n\n  Soon, all three of us were at the mall, armed with nuclear power packs and\nlightning rods.  If any loser came along, we'd fry it!  Two of the crazed\nzombies stalked towards us, and they got dropped, but many more were on their\nway!  We used the \"How to Hotwire Cars\" g-phile to our advantage since we were\nstill at the mall.  In 15 mins.  we were at Weatherman's house, where he had\nalready made enough cocktails out of Molsens to make a pretty good size\ninferno.  We hit the highway in the same pickup that we hotwired.  AB in the\nback made some craters behind us to keep them from following.  We heard\n\"K-RAD...K00L...AWESUM\" in the distance as waves of those brain-damaged demons\nchanted.  Quickly,Weatherman blasted his Metallica tape to keep their\npossessive chanting from controlling our minds!  Nowhere, no one, and nobody\nwas safe from their evil cletches, until...\n\n  We arrived at Emdy Pirates HQ.  All of the Emdy's were assembled in a huddled\nmass, wondering what to do.  Finally, an idea was heard.  \"We shall terminate\nevery phone line in the U.S.  When they realize that there are no more of their\n'K-rad' boards to call, they will eventually die off.\" Shouts of glory were\nheard as we went on our way to the nearest telephone pole.  Rotten Apple\nclimbed up the rungs, as I tossed him the Blotto box I had packed away.  After\nthe setup had been checked he came back down and witnessed the unbelievable\nfeat.  Sparks flew everywhere as the sky lit up with lightning that singed the\nair with ozone!  Bolts struck here and there, cutting those bitches to ribbons!\nFor 25 mins.  the electricity raged, burning any trace of losers, leechers, and\nthe like where they stood.  And for 25 mins.  the world rejoiced....\n\n  However, what were we to do w/o phone lines ourselves?  We only hoped that\nC&P was as reliable as they said they were.  In a matter of days, all the lines\nwere restored, all the boards had been given a good housecleaning, and there\nwere no leeches for once.  Ahhh...  The sound of a board no longer busy from\nthe commies who logon long enough to see the 'Other AE's' list, and then\nlogoff.  However, I'm sure there are still a FEW more of those assholes left.\nBut we'll be ready....\n\n  ....Emdy Pirates....\n\n  \"Exterminating losers on sight\"\n\nWeatherstation......301/661-9355 1.5 megs\nTerminal Obsession..301/298-0094 GS AE!\nRazor's Edge(CtC)...301/561-6161 20 megs\nFalcon's Lair.......201/330-9104 22 megs\n\n\nSource:  http://textfiles.com/humor/COMPUTER/nightlec.hum"
  },
  {
    "id": 3,
    "text": "  This machine contains a special circuit called a 'Crisis Detector'(or 'CD').\nIt is specifically designed to detect the user's emotional state in terms of\nhow desperately the user needs to use the machine.  The machine, upon measuring\nthis state, assigns a value, called the 'Crisis Detection Level' (or 'CDL').\nIt has been programmed to subsequently create a malfunction in direct\nproportion to this CDL, thus rendering the machine totally and hopelessly\nuseless to the user for whatever period of usefulness it may have served.\n\n  Threatening the machine with violence, curses, obscenities, etc., may soothe\nthe user, but will serve no other useful purpose, as the CD is not affected,\nand the CDL is not, repeat, NOT reset.\tLikewise, attempts to use another\nmachine is likely to cause IT to malfunction, since they both belong to the\nsame union(LOCAL #347).  Just give up, and come back later, when you have\nabsolutely NO use for the machine, as by then the CD will have noted your\nabsence and will have reset the CDL for its next victim.\n\n  NOTE:  Attempts to go away and come back a few minutes later are not liable\nto fool the CD, as your level of desperation will only have increased during\nsaid period of time.  Just give up.  It's truly HOPELESS.\n\n\nSource:  http://textfiles.com/humor/COMPUTER/warning.hum"
  }  
],
  "motd": [
  {
    "id": 0,
    "text": "Welcome to Our Gift App.  You can add gifts and mark them as purchased."
  }
],
  "profile": {
    "name": "typicode"
  }
}
