
{
  "posts": [
  {
    "id": 0,
    "text": "Computer Mouse Balls"
  },
  {
    "id": 1,
    "text": "The Geekcode"
  },
  {
    "id": 2,
    "text": "Noise"
  },
  {
    "id": 3,
    "text": "Title 4"
  }  
],
  "texts": [
  {
    "id": 0,
    "text": "Abstract:  Mouse Balls Available as FRU (Field Replacement Unit)\nMouse balls are now available as FRU.  Therefore, if a mouse fails to operate or should it perform erratically, it may need a ball replacement.  Because of the delicate nature of this procedure, replacement of mouse balls should only be attempted by properly trained personnel. \n\nSource: http://textfiles.com/100/balls.txt"
  },
  {
    "id": 1,
    "text": "So you think you are a geek, eh?  The first step is to admit to yourself your geekiness.  No matter what anyone says, geeks are people too; geeks have rights.  So take a deep breath and announce to the world that you are a geek.  Your courage will give you strength that will last you forever. \n\nHow to tell the world you are a geek, you ask?  Use the universal Geek code.  By joining the geek organization, you have license to use this special code that will allow you to let other un-closeted geeks know who you are in a simple, codified statement.\n\nThe single best way to announce your geekhood is to add your geek code to signature file and announce it far and wide.  But be careful, you may give other geeks the courage to come out of the closet.  You might want to hang on to your copy of the code in order to help them along. \n\n\nSource: http://textfiles.com/100/codegeek.txt "
  },
  {
    "id": 2,
    "text": "-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n-\t\t\t\t\t\t\t\t     -\n-\t\tVariable-pitched frequency generator\t\t     -\n-\t\t\t       or\t\t\t\t     -\n-\t\t   How to annoy your techers!\t\t\t     -\n-\t\t\t\t\t\t\t\t     -\n-\t\t\t   Written By\t\t\t\t     -\n-\t\t\t\t\t\t\t\t     -\n-\t\t      ::: Captain Quieg :::\t\t\t     -\n-\t\t\t\t\t\t\t\t     -\n-\t\t\t\t\t\t\t\t     -\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n\nIn the fast paced world of education one often finds oneself with a burning\nhatred towards one or more teachers or fellow students.  This article will\ndescribe how to build a little device that will emit a very high freqency that\nis -extrememly- annoying to most people and it will wreck concentration and can\ncause some nasty headaches.\n\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n\nParts needed:\n\nR1: 100k ohm Trimmer potentiometer\nR2: 47k ohm resistor (5% tolerance)\nC1: 4.7 uF Polarized electrolytic capacitor\nC2: small disc capacitor (.001 uF or less)\nSP:  8 ohm speaker.  Piezo buzzers work best but you can use most any speaker\nfor this job.\nIC:  555 timer Integrated Circut..  Availible at Radio shack or any decent\nelectronics store\n\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n\nLet's start with a schematic of the device..\n\n!\t  V+ (9 volts)\n! R1\t  :\nV\t  :\n^^^^^-----------------\n:\t    :8\t     :4\n:      !------------------!\n:     7!\t\t  !3\n:------!\t\t  !-------------\n:      !\t\t  !\t       :\n:      !       IC\t  !\t      --- /!\n\\      !\t\t  !\t      ! !/ !\n/R2    !\t    (555) !\tSPKR  ! !  !\n\\47k  6!\t\t  !\t      ! !  !\n/   ---!\t\t  !\t      ! !  !\n:   !  !\t\t  !\t      ! !\\ !\n:   ! 2!\t\t  !\t      --- \\!\n:------!\t\t  !\t       :\n:      !------------------!\t     + :\n:\t      :1\t\t   C1 ---\n:\t      : \t\t      ---\n:\t      :----- V- (9 volts)    - :\n:\t      : \t\t       :\n:\t      : \t\t       :\n:     ! !C2   : \t\t       :\n:-----! !-------------------------------\n! !.001uF\t\t\t :\n\t\t\t\t\t   -----\n\t\t\t\t\t    ---\n\t\t\t\t\t     - GND\n\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n\nOkay\nNow that we have the schematic out of the way we can discuss construction..\nIt's best to use an 8-pin socket for soldering before you put the IC in..  You\ncan put it on a small PC board or perfboard..  Use R1 (the potentiometer) to\nadjust the frequency from a high whistle to an instant migrane.  If you find\nthat the freqency is not as high as desired use a smaller capacitor for C2.\nThe Idea here is to bring the frequency just below the highest frequency that\ncan be perceived by the human ear.  You will definetly know when you have\nacheived this!\tOnce finished mount it in a project case with an on/off switch\nand you're ready.\n\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\n\nUse\n---\n\nOne particularly nice thing about this device is that if you set it to a high\nenough frequency it is almost impossible to locate once hidden..  So once\nyou've found a suitible location put it anywhere were it can't easily be seen\nand turn it on..  Guaranteed results!  ..  One little problem with this thing\nis that some teachers don't seem to hear it (generally older teachers)..  but\nanyone with a good set of ears will be driven crazy by it!!  Including you if\nyou place it in a room that you are planning to be in for any length of time..\nSo DONT.  If you have any questions about this thing I'll be happy to answer\ninquiries..  Have fun!\n\n::: Captain Quieg :::\n\n-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-[]-\nCall The Works BBS - 1600+ Textfiles! - [914]/238-8195 - 300/1200 - Always Open\n\u001a"
  },
  {
    "id": 3,
    "text": "Body 4"
  }  
],
  "profile": {
    "name": "typicode"
  }
}
