
{
  "posts": [
  {
    "id": 0,
    "text": "Computer Mouse Balls"
  },
  {
    "id": 1,
    "text": "The Geekcode"
  },
  {
    "id": 2,
    "text": "Night of the Hackers"
  },
  {
    "id": 3,
    "text": "Warning: This Machine Breaks Down During Periods of Critical Need!"
  }  
],
  "texts": [
  {
    "id": 0,
    "text": "Abstract:  Mouse Balls Available as FRU (Field Replacement Unit)\nMouse balls are now available as FRU.  Therefore, if a mouse fails to operate or should it perform erratically, it may need a ball replacement.  Because of the delicate nature of this procedure, replacement of mouse balls should only be attempted by properly trained personnel. \n\nSource: http://textfiles.com/100/balls.txt"
  },
  {
    "id": 1,
    "text": "So you think you are a geek, eh?  The first step is to admit to yourself your geekiness.  No matter what anyone says, geeks are people too; geeks have rights.  So take a deep breath and announce to the world that you are a geek.  Your courage will give you strength that will last you forever. \n\nHow to tell the world you are a geek, you ask?  Use the universal Geek code.  By joining the geek organization, you have license to use this special code that will allow you to let other un-closeted geeks know who you are in a simple, codified statement.\n\nThe single best way to announce your geekhood is to add your geek code to signature file and announce it far and wide.  But be careful, you may give other geeks the courage to come out of the closet.  You might want to hang on to your copy of the code in order to help them along. \n\n\nSource: http://textfiles.com/100/codegeek.txt "
  },
  {
    "id": 2,
    "text": "                 \n\n     As you are surveying a dark and misty swamp you come across what appears\nto be a small cave.  You light a torch and enter.  You have walked several\nhundred feet when stumble into a bright blue portal... With a sudden burst of\nlight and a loud explosion you are swept into... DRAGONFIRE... PRESS ANY KEY IF\nYOU DARE.\n\n     You have programmed your personal computer to dial into Dragonfire, a\ncomputer bulletin board in Gainesville, Texas.  But before you get any\ninformation, Dragonfire demands your name, home city and phone number.  So, for\ntonights tour of the electronic wilderness you become Montana Wildhack (a\ncharacter in Kurt Vonnegut's book 'Slaughterhouse Five') of San Francisco.\n\n     Dragonfire, Sherwood Forrest(sic), Forbidden Zone, Blottoland, Plovernet,\nThe Vault, Shadowland, PHBI and scores of other computer bulletin boards are\nhang-outs of a new generation of vandals.  These precocious teen-agers use\ntheir electronic skills with to play hide-and-seek with computer and security\nforces.  Many computer bulletin boards are perfectly legitimate:  They resemble\nthe electronic versions of the familiar cork boards in supermarkets and school\ncorridors, listing services and providing information someone out there is\nbound to find useful.  But this is a walk on the wild side, a trip into the\nworld of underground bulletin boards dedicated to encouraging -- and making --\nmischief.\n\n     The numbers for these boards are as closely guarded as a psychiatrist's\nhome telephone number.  Some numbers are posted on underground boards; others\nare exchanged over the telephone.  A friendly hacker provided Dragonfire's\nnumber.  Hook up and see a broad choice of topics offered.  For Phone Phreaks\n-- who delight in stealing service from AT&T and other phone networks --\nPhreakenstein's Lair is a potpourri of phone numbers, access codes and\ntechnical information.  For computer hackers -- who dial into other people's\ncomputers -- Ranger's Lodge is chock full of phone numbers and passwords for\ngovernment, university and corporate computers.\n\n     Moving through Dragonfire's offerings, you can only marvel at how\nconversant these teen-agers are with the technical esoterica of today's\nelectronic age.  Obviously they have spent a great deal of time studying\ncomputers, though their grammar and spelling indicate they haven't been as\ndiligent in other subjects.  You are constantly reminded of how young they\nare...\n\n    \"Well it's that time of year again.  School is back in session so let's get\nthose high school computer phone numbers rolling in.  Time to get straight A's,\nhave perfect attendance(except when you've been up all night hacking school\npasswords), and messing up your worst teacher's paycheck.\"\n\n    Forbidden Zone, in Detroit, is offering ammunition for hacker civil war --\ntips on crashing the most popular bulletin-board software.  There are also\nplans for building black, red and blue boxes to mimic operator tones and get\nfree phone service.  And here are the details for 'the safest and best way to\nmake and use nitroglycerin,' compliments of Doctor Hex, who says he got it\n'from my chemistry teacher.'\n\n    Flip through the 'pages.'  You have to wonder if this information is\naccurate. Can this really be the phone number and password for Taco Bell's\ncomputer?  Do these kids really have the dial-up numbers for dozens of\nuniversity computers?  The temptation is too much.  You sign off and have\nyour computer dial the number for the Yale computer.  Bingo -- the words Yale\nUniversity appear on your screen.  You hang up in sweat.  You are now a Hacker.\n\n    Punch in another number and your modem zips off the touch tones.  Here is\nthe tedious side of all this.  Bulletin boards are popular.  No vacancy at\nBates Motel (named for Anthony Perkin's creepy motel in the movie 'Psycho');\nthe line is busy.  So are 221 B. Baker Street, PHBI, Shadowland and The Vault.\nCeaser's Palace rings and connects.  This is a different breed of board.\nCeaser's Palace is a combination Phreak board and computer store in Miami.\nThis is the place to learn ways to mess up a department store's antishoplifting\nsystem, or make free calls on telephone with locks the dial.  Pure capitalism\naccompanies such anarchy.  Ceaser's Palace is offering good deals on disk\ndrives, software, computers and all sorts of hardware.  Orders are placed\nthrough electronic mail messages.\n\n    'Tele-Trial':  Bored by Ceaser's Palace, you enter the number for\nBlottoland, the board operated by one of the nation's most notorious computer\nphreaks -- King Blotto.  This one has been busy all night, but it is now pretty\nlate in Cleveland.  The phone rings and you connect.  To get past the blank\nscreen, type the seconday password 'S-L-I-M-E.'  King Blotto obliges, listing\nhis rules:  He must have your real name, phone number, address, occupation and\nintrests.  He will call and disclose the primary password, 'if you belong on\nthis board.'  If admitted, do not reveal the phone number or secondary\npassword, lest you face 'tele-trial,' the King warns as he dismisses you by\nhanging up.\n\n     You expected heavy security, but this teen-ager's security is, as they\nsay, awesome.  Computers at the Defense Department and hundreds of businesses\nlet you know when you reached them.  Here you need a password just to find out\nwhat system answered the phone.  Then King Blotto asks questions -- and hangs\nup.  Professional computer-security experts could learn something from this\nkid.  He knows that ever since the 414 computer hackers were arrested in August\n1982, law-enforcement officers have searching for leads on computer bulletin\nboards.\n\n     'Do you have any ties or connections with any law enforcement agency or\nany any agency which would inform such a law-enforcement agency of this\nbulletin board?'\n\n     Such is the welcoming message from Plovernet, a Florida board known for\nits great hack/phreak files.  There amid a string of valid VISA and Mastercard\nnumbers are dozens of computer phone numbers and passwords.  Here you also\nlearn what Blotto means by tele-trial.  'As some of you may or may not know, a\nsession of conference court was held and the Wizard was found guilty of\nmiscellaneous charges, and sentenced to four months without bulleting boards.'\nIf Wizard calls, system operators like King Blotto disconnect him.\n\n     Paging through the bulletin boards is a test of your patience.  Each board\nhas different commands.  Few are easy to follow, leaving you to hunt and peck\nyour way around.  So far you haven't has the nerve to hit 'C,' which summons\nthe system operator for a live, computer-to-computer conversation.\n\n     The time, however, has come for you to ask a few questions of the 'sysop.'\nYou dial a computer in Boston.  It answers and you begin working your way\nthrough the menus.  You scan a handful of dial-up numbers including one for\nArpanet, the Defense Department's research computer.  Bravely tap C and in\nseconds the screen blanks and your cursor dances across the screen.\n\n     Hello... What kind of computer do you have?\n\n     Contact.  The sysop is here.  You exchange amenities and get 'talking.'\nHow much hacking does he do?  Not much, too busy.  Is he afraid of being\nbusted, having his computer confiscated like the Los Angeles man facing\ncriminal charges because his computer bulletin board system contained a stolen\ntelephone-credit-card number?  'Hmmmmm... No,' he replies.  Finally he asks the\ndreaded question:  'How old are you?'  'How old are YOU,' you reply, stalling.\n'15,' he types.  Once you confess and he knows you're old enough to be his\nfather, the conversation gets very serious.  You fear each new question; he\nprobably thinks you're a cop.  But all he wants to know is your choice for\npresident.  The chat continues, until he asks, 'What time is it there?'  Just\npast midnight, you reply.  Expletive.  'It's 3:08 here,' Sysop types.  'I must\nbe going to sleep.  I've got school tomorrow.'  The cursor dances.\n'*********** Thank You for Calling.'  The screen goes blank.\n\n\n\n"
  },
  {
    "id": 3,
    "text": "  This machine contains a special circuit called a 'Crisis Detector'(or 'CD').\nIt is specifically designed to detect the user's emotional state in terms of\nhow desperately the user needs to use the machine.  The machine, upon measuring\nthis state, assigns a value, called the 'Crisis Detection Level' (or 'CDL').\nIt has been programmed to subsequently create a malfunction in direct\nproportion to this CDL, thus rendering the machine totally and hopelessly\nuseless to the user for whatever period of usefulness it may have served.\n\n  Threatening the machine with violence, curses, obscenities, etc., may soothe\nthe user, but will serve no other useful purpose, as the CD is not affected,\nand the CDL is not, repeat, NOT reset.\tLikewise, attempts to use another\nmachine is likely to cause IT to malfunction, since they both belong to the\nsame union(LOCAL #347).  Just give up, and come back later, when you have\nabsolutely NO use for the machine, as by then the CD will have noted your\nabsence and will have reset the CDL for its next victim.\n\n  NOTE:  Attempts to go away and come back a few minutes later are not liable\nto fool the CD, as your level of desperation will only have increased during\nsaid period of time.  Just give up.  It's truly HOPELESS.\n\n"
  }  
],
  "profile": {
    "name": "typicode"
  }
}
