
{
  "posts": [
  {
    "id": 0,
    "text": "Computer Mouse Balls"
  },
  {
    "id": 1,
    "text": "The Geekcode"
  },
  {
    "id": 2,
    "text": "Night of the Hackers"
  },
  {
    "id": 3,
    "text": "Warning: This Machine Breaks Down During Periods of Critical Need!"
  }  
],
  "texts": [
  {
    "id": 0,
    "text": "Abstract:  Mouse Balls Available as FRU (Field Replacement Unit)\nMouse balls are now available as FRU.  Therefore, if a mouse fails to operate or should it perform erratically, it may need a ball replacement.  Because of the delicate nature of this procedure, replacement of mouse balls should only be attempted by properly trained personnel. \n\nSource: http://textfiles.com/100/balls.txt"
  },
  {
    "id": 1,
    "text": "So you think you are a geek, eh?  The first step is to admit to yourself your geekiness.  No matter what anyone says, geeks are people too; geeks have rights.  So take a deep breath and announce to the world that you are a geek.  Your courage will give you strength that will last you forever. \n\nHow to tell the world you are a geek, you ask?  Use the universal Geek code.  By joining the geek organization, you have license to use this special code that will allow you to let other un-closeted geeks know who you are in a simple, codified statement.\n\nThe single best way to announce your geekhood is to add your geek code to signature file and announce it far and wide.  But be careful, you may give other geeks the courage to come out of the closet.  You might want to hang on to your copy of the code in order to help them along. \n\n\nSource: http://textfiles.com/100/codegeek.txt "
  },
  {
    "id": 2,
    "text": "From genrad!decvax!microsoft!uw-beaver!tektronix!orca!davidl Thu Dec 15 13:03:52 1983\nRelay-Version: version B 2.10.1 6/24/83; site mit-eddie.UUCP\nPosting-Version: version B 2.10.1 (Tek) 9/26/83; site orca.UUCP\nPath: mit-eddie!genrad!decvax!microsoft!uw-beaver!tektronix!orca!davidl\nFrom: davidl@orca.UUCP (David Levine)\nNewsgroups: net.jokes\nSubject: A nightmare\nMessage-ID: <401@orca.UUCP>\nDate: Thu, 15-Dec-83 13:03:52 EST\nArticle-I.D.: orca.401\nPosted: Thu Dec 15 13:03:52 1983\nDate-Received: Sun, 18-Dec-83 07:13:47 EST\nOrganization: Tektronix, Wilsonville OR.\nLines: 55\n\nLast night I dreamed that the Real World had adopted the \"Unix Philosophy.\"\n\nI went to a fast-food place for lunch.  When I arrived, I found that\nthe menu had been taken down, and all the employees were standing in a\nline behind the counter waiting for my orders.  Each of them was\nsmaller than I remembered, there were more of them than I'd ever seen\nbefore, and they had very strange names on their nametags.\n\nI tried to give my order to the first employee, but he just said\nsomething about a \"syntax error.\"  I tried another employee with no more\nluck.  He just said \"Eh?\" no matter what I told him.  I had similar\nexperiences with several other employees.  (One employee named \"ed\"\ndidn't even say \"Eh?,\" he just looked at me quizzically.)  Disgusted, I\nsought out the manager (at least it said \"man\" on his nametag) and\nasked him for help.  He told me that he didn't know anything about\n\"help,\" and to try somebody else with a strange name for more\ninformation.\n\nThe fellow with the strange name didn't know anything about \"help\"\neither, but when I told him I just wanted to order he directed me to a\ngirl named \"oe,\" who handled order entry.  (He also told me about\nseveral other employees I couldn't care less about, but at least I got\nthe information I needed.)\n\nI went to \"oe\" and when I got to the front of the queue she just smiled\nat me.  I smiled back.  She just smiled some more.  Eventually I\nrealized that I shouldn't expect a prompt.  I asked for a hamburger.\nShe didn't respond, but since she didn't say \"Eh?\" I knew I'd done\nsomething right.  We smiled at each other for a little while longer,\nthen I told her I was finished with my order.  She directed me to the\ncashier, where I paid and received my order.\n\nThe hamburger was fine, but it was completely bare... not even a bun.\nI went back to \"oe\" to complain, but she just said \"Eh?\" a lot.  I went\nto the manager and asked him about \"oe.\"  The manager explained to me\nthat \"oe\" had thousands of options, but if I wanted any of them I'd\nhave to know in advance what they were and exactly how to ask for them.\n\nHe also told me about \"vi,\" who would write down my order and let me\ncorrect it before I was done, and how to hand the written order to\n\"oe\".  \"vi\" had a nasty habit of writing down my corrections unless I\ntold her that I was about to make a correction, but it was still easier\nthan dealing directly with \"oe.\"\n\nBy this time I was really hungry, but I didn't have enough money to\norder again, so I figured out how to redirect somebody else's order to\nmy plate.  Security was pretty lax at that place.\n\nAs I was walking out the door, I was snagged in a giant Net.  I\nscreamed and woke up.\n\n-- \nDavid D. Levine   (...decvax!tektronix!tekecs!davidl)      [UUCP]\n                  (...tekecs!davidl.tektronix@rand-relay)  [ARPA]"
  },
  {
    "id": 3,
    "text": "  This machine contains a special circuit called a 'Crisis Detector'(or 'CD').\nIt is specifically designed to detect the user's emotional state in terms of\nhow desperately the user needs to use the machine.  The machine, upon measuring\nthis state, assigns a value, called the 'Crisis Detection Level' (or 'CDL').\nIt has been programmed to subsequently create a malfunction in direct\nproportion to this CDL, thus rendering the machine totally and hopelessly\nuseless to the user for whatever period of usefulness it may have served.\n\n  Threatening the machine with violence, curses, obscenities, etc., may soothe\nthe user, but will serve no other useful purpose, as the CD is not affected,\nand the CDL is not, repeat, NOT reset.\tLikewise, attempts to use another\nmachine is likely to cause IT to malfunction, since they both belong to the\nsame union(LOCAL #347).  Just give up, and come back later, when you have\nabsolutely NO use for the machine, as by then the CD will have noted your\nabsence and will have reset the CDL for its next victim.\n\n  NOTE:  Attempts to go away and come back a few minutes later are not liable\nto fool the CD, as your level of desperation will only have increased during\nsaid period of time.  Just give up.  It's truly HOPELESS.\n\n"
  }  
],
  "profile": {
    "name": "typicode"
  }
}
